In [7]:
import mysql.connector as connector
connection=connector.connect(user="Daniel",password="Daniel12345")
cursor = connection.cursor()

In [8]:
cursor.execute("CREATE DATABASE little_lemon_db")

In [9]:
cursor.execute("USE little_lemon_db")

In [10]:
create_menuitem_table = """CREATE TABLE MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""
cursor.execute(create_menuitem_table)

In [11]:
create_menu_table = """CREATE TABLE Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""
cursor.execute(create_menu_table)

In [12]:
Create_booking_table = """CREATE TABLE Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""
cursor.execute(Create_booking_table)

In [13]:
create_orders_table = """CREATE TABLE Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""
cursor.execute(create_orders_table)

In [14]:
create_employees_table = """CREATE TABLE Employees (
EmployeeID INT AUTO_INCREMENT PRIMARY KEY,
Name VARCHAR (255),
Role VARCHAR (100),
Address VARCHAR (255),
Contact_Number INT,
Email VARCHAR (255),
Annual_Salary VARCHAR (100)
);"""
cursor.execute(create_employees_table)

In [17]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary)
VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

In [25]:
delete_query = "DELETE FROM MenuItems"
cursor.execute(delete_query)
connection.commit()
delete_query = "DELETE FROM Menus"
cursor.execute(delete_query)
connection.commit()
delete_query = "DELETE FROM Bookings"
cursor.execute(delete_query)
connection.commit()
delete_query = "DELETE FROM Orders"
cursor.execute(delete_query)
connection.commit()
delete_query = "DELETE FROM employees"
cursor.execute(delete_query)
connection.commit()

In [26]:
# Populate MenuItems table
cursor.execute(insert_menuitems)
connection.commit()

# Populate MenuItems table
cursor.execute(insert_menu)
connection.commit()

# Populate Bookings table
cursor.execute(insert_bookings)
connection.commit()

# Populate Orders table
cursor.execute(insert_orders)
connection.commit()

# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

In [29]:
import mysql.connector

# Assuming you have already set up the connection pool
pool = mysql.connector.pooling.MySQLConnectionPool(
    pool_name='pool_connection_1',
    pool_size=10,
    host='127.0.0.1',
    user='Daniel',
    password='Daniel12345',
    database='little_lemon_db'
)

# Get a connection from the pool
connection = pool.get_connection()
cursor = connection.cursor()

# Define the procedure

In [5]:
mysql_procedure = """
CREATE PROCEDURE PeakHours(OUT PeakHour INT, OUT NumberOfBookings INT)
BEGIN
  SELECT 
    HOUR(BookingSlot), COUNT(*) 
  INTO 
    PeakHour, NumberOfBookings 
  FROM 
    bookings
  GROUP BY 
    HOUR(BookingSlot)
  ORDER BY 
    NumberOfBookings DESC
  LIMIT 1;
END;
"""

In [6]:
cursor.execute(mysql_procedure)

In [7]:
cursor.execute("CALL PeakHours(@PeakHour,@NumberOfBookings);")
# Fetch the values of the OUT parameters
cursor.execute("SELECT @PeakHour, @NumberOfBookings")

# Fetch the result
result = cursor.fetchone()

# Print the values
peak_hour = result[0]
number_of_bookings = result[1]
print("Peak Hour:", peak_hour)
print("Number of Bookings:", number_of_bookings)

Peak Hour: 19
Number of Bookings: 2

In [12]:
mysql_2 = """
CREATE PROCEDURE GuestStatus()
BEGIN
    SELECT CONCAT(B.GuestFirstName, ' ', B.GuestLastName) AS GuestName,
    CASE
        WHEN E.Role IN ('Manager', 'Assistant Manager') THEN 'Ready to pay'
        WHEN E.Role = 'Head Chef' THEN 'Ready to serve'
        WHEN E.Role = 'Assistant Chef' THEN 'Preparing Order'
        WHEN E.Role = 'Head Waiter' THEN 'Order served'
        ELSE 'Unknown'
    END AS Status
    FROM Bookings B
    LEFT JOIN Employees E ON B.EmployeeID = E.EmployeeID;
END;
"""

In [30]:
cursor.execute("CALL GuestStatus();")
result = cursor.fetchall()
column_names = [desc[0] for desc in cursor.description]
print("Column Names:", column_names)
for row in result:
    print(row)

Column Names: ['GuestName', 'Status']
('Anna Iversen', 'Ready to pay')
('Joakim Iversen', 'Ready to pay')
('Vanessa McCarthy', 'Ready to serve')
('Marcos Romero', 'Preparing Order')
('Hiroki Yamane', 'Ready to pay')
('Diana Pinto', 'Order served')